OpenFOAM-v2412/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// includedAngle:
// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges

vessel.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod    extractFromSurface;

    includedAngle       120;

    // Write options

    // Write features to obj format for postprocessing
    writeObj            no;
}

gasInlet.stl
{

    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}

stirrer.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}

outlet.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}

/*
baffles.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}

rotating.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}

sparger.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       120;

    writeObj            no;
}
*/


// ************************************************************************* //
